In [29]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [30]:
import pandas as pd

In [31]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [32]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [33]:
# updating column name
df.columns = ['first_name', 'last_name', 'email']

In [34]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [35]:
df.columns =[x.upper() for x in df.columns]

In [36]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [37]:
df.rename(columns={'FIRST_NAME': 'first', 'LAST_NAME': 'last'}, inplace=True)

In [38]:
df

   first     last                    EMAIL
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [42]:
df.rename(columns={ 'EMAIL': 'email'}, inplace=True)
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [43]:
df.loc[2]

first                 John
last                   Doe
email    johndoe@email.com
Name: 2, dtype: object

In [44]:
#changing the value of row for john 
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith      JohnSmith@email.com

In [45]:
#now only changin the last_name and email 
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        JohnDoe@email.com

In [47]:
#lowering the string 
df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

#### USE OF APPLY

In [48]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [52]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [53]:
len(df['email'])

3

In [54]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [55]:
df.apply(lambda x:x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [56]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     17

In [57]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe        johndoe@email.com

In [58]:
#note : applymap works for dataframe as apply would work for series

In [59]:
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [60]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com

In [61]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [62]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John      Doe        johndoe@email.com